[
  {
    "name": "Aloe Vera",
    "scientificName": "Aloe barbadensis miller",
    "description": "Aloe Vera is a succulent plant known for its medicinal and skincare benefits. It has thick, fleshy leaves filled with a soothing gel used for treating burns, wounds, and skin conditions. The plant also aids digestion and boosts the immune system.",
    "modelPath": "/models/aloe_vera.glb",
    "careInstructions": "Requires well-draining soil, minimal watering, and bright indirect sunlight. Water only when the soil is completely dry. Protect from frost and extreme cold. Repot occasionally to encourage growth."
  },
  {
    "name": "Amla",
    "scientificName": "Phyllanthus emblica",
    "description": "Indian Gooseberry, rich in Vitamin C, used in Ayurveda for its immunity-boosting properties. It is known to improve digestion, enhance hair health, and support liver function.",
    "modelPath": "/models/amla.glb",
    "careInstructions": "Thrives in well-drained soil and requires moderate sunlight. Water regularly but avoid overwatering. Occasional pruning helps maintain shape and encourages fruiting."
  },
  {
    "name": "Ashwagandha",
    "scientificName": "Withania somnifera",
    "description": "A medicinal herb known for its adaptogenic properties, used to reduce stress, improve brain function, and boost immunity. It is widely used in Ayurveda for its rejuvenating effects.",
    "modelPath": "/models/ashwagandha.glb",
    "careInstructions": "Prefers dry conditions and sandy soil. Requires full sunlight and occasional watering. Avoid excessive moisture to prevent root rot. Harvest roots after 5-6 months of growth."
  },
  {
    "name": "Cactus",
    "scientificName": "Cactaceae",
    "description": "Cacti are drought-resistant plants with thick, fleshy stems that store water, making them perfect for arid climates. They require minimal maintenance and can purify indoor air.",
    "modelPath": "/models/cactus.glb",
    "careInstructions": "Needs sandy soil, full sun, and occasional watering. Water sparingly, especially in winter. Avoid overwatering to prevent root rot. Use a well-draining pot for indoor cacti."
  },
  {
    "name": "Ceropegia mahabalei",
    "scientificName": "Ceropegia mahabalei",
    "description": "A rare and unique climbing plant with delicate, tubular flowers. It is known for its ornamental value and is often grown as a hanging plant.",
    "modelPath": "/models/ceropegiamahabalei.glb",
    "careInstructions": "Thrives in well-drained soil, moderate sunlight, and occasional watering. Avoid direct harsh sunlight. Use a support structure for climbing."
  },
  {
    "name": "Fennel(saunf)",
    "scientificName": "Foeniculum vulgare",
    "description": "Fennel, known as Saunf in many parts of Asia, is a fragrant herb with feathery leaves and yellow flowers. Its seeds have a sweet, licorice-like flavor and are widely used in culinary applications around the world. The entire plant is edible, from its bulbous base to its seeds. Fennel has been used for centuries in traditional medicine to aid digestion, reduce bloating, and even increase milk production in nursing mothers. It contains essential oils that have antimicrobial and anti-inflammatory properties. The plant is also rich in vitamins and minerals, particularly vitamin C, potassium, and fiber, making it a nutritious addition to both meals and herbal remedies.",
    "modelPath": "/models/fennel(saunf).glb",
    "careInstructions": "Fennel thrives in well-drained, fertile soil with a pH between 6.0 and 7.0. Plant in a sunny location that receives at least 6-8 hours of direct sunlight daily. Maintain consistent moisture, particularly during dry periods, but avoid waterlogging. Apply a balanced fertilizer in early spring and again when the plant begins to flower. Space plants about 12-18 inches apart to allow proper air circulation. Protect young plants from strong winds. Harvest leaves as needed throughout the growing season, and collect seeds after they have dried on the plant. Fennel can self-seed readily, so remove flower heads before they set seed if you want to control its spread."
  },
  {
    "name": "Ficus Ginseng",
    "scientificName": "Ficus microcarpa",
    "description": "Ficus Ginseng, also known as the Banyan Fig, is a popular bonsai tree characterized by its thick, aerial roots that resemble human limbs, hence the name 'ginseng'. This ornamental plant features glossy, oval-shaped dark green leaves and a swollen trunk base that gives it a distinctive appearance. Originally from East Asia, it has become a beloved indoor plant worldwide for its aesthetic appeal and ability to thrive in indoor environments. Ficus Ginseng symbolizes longevity, strength, and peace in many cultures. Its compact size makes it perfect for desk decoration while still providing the benefits of having greenery indoors, such as air purification and increased humidity. The plant's unique root formation and trunk create a miniature tree-like appearance, making it an excellent choice for those interested in bonsai cultivation without extensive maintenance requirements.",
    "modelPath": "/models/ficusginseng.glb",
    "careInstructions": "Ficus Ginseng prefers bright, indirect light but can tolerate moderate shade, making it adaptable to indoor conditions. Avoid placing in direct sunlight, which can scorch the leaves. Water thoroughly when the top inch of soil feels dry, typically once a week, but reduce watering in winter. Ensure excellent drainage to prevent root rot. Maintain humidity around 40-60% by occasionally misting the leaves or using a humidity tray. Feed with a balanced liquid fertilizer diluted to half strength every 4-6 weeks during the growing season (spring through fall). Prune to maintain shape and size, focusing on removing any crossing or leggy branches. Repot every 2-3 years in spring using well-draining bonsai soil. Keep away from drafts and sudden temperature changes, as the plant may respond by dropping leaves."
  },
  {
    "name": "Geranium Flower",
    "scientificName": "Pelargonium",
    "description": "Geranium flowers, scientifically known as Pelargonium, are vibrant flowering plants renowned for their colorful blooms and distinctive scented foliage. These ornamental beauties produce clusters of five-petaled flowers in shades of red, pink, purple, orange, white, and bi-colors that bloom profusely throughout the growing season. Native to South Africa, geraniums have become one of the most popular garden and container plants worldwide due to their drought tolerance and long blooming period. Beyond their ornamental value, certain varieties of geraniums offer medicinal properties, with their essential oils used in aromatherapy to reduce stress and promote relaxation. Their aromatic leaves, which release a characteristic scent when brushed against or crushed, serve as natural insect repellents. The plants are also known for their air-purifying qualities, removing harmful toxins from indoor environments.",
    "modelPath": "/models/geraniumflower.glb",
    "careInstructions": "Geraniums thrive in well-draining soil with a slightly acidic to neutral pH. Plant in containers or garden beds that receive 4-6 hours of direct sunlight daily, preferably morning sun with afternoon shade in hot climates. Water thoroughly when the top inch of soil feels dry, allowing excess water to drain away. Avoid overhead watering to prevent fungal diseases on foliage. Fertilize every 4-6 weeks during the growing season with a balanced, water-soluble fertilizer. Deadhead spent blooms regularly to encourage continuous flowering and pinch back growing tips to promote bushier growth. In cold climates, either bring potted geraniums indoors before first frost or take cuttings for propagation, as most varieties are not frost-hardy. Indoors, place near a sunny window and reduce watering. Watch for pests such as aphids or whiteflies, treating promptly with insecticidal soap if detected."
  },
  {
    "name": "Giloy",
    "scientificName": "Tinospora cordifolia",
    "description": "Giloy, also known as Amrita or Guduchi, is a climbing shrub native to tropical regions of India and Southeast Asia. This powerful Ayurvedic herb has been used for thousands of years in traditional medicine and is often referred to as the 'root of immortality' due to its numerous health benefits. The heart-shaped leaves and climbing nature of Giloy allow it to grow along trellises, walls, or other plants for support. All parts of the plant, including stems, roots, and leaves, contain bioactive compounds with medicinal properties. Giloy is renowned for its immune-boosting capabilities, anti-inflammatory effects, and antioxidant properties. It helps in managing diabetes, reducing stress, improving digestion, and purifying blood. The plant contains alkaloids, steroids, glycosides, and other compounds that contribute to its therapeutic potential. During the COVID-19 pandemic, Giloy gained additional recognition for its immune-enhancing properties.",
    "modelPath": "/models/giloy.glb",
    "careInstructions": "Giloy thrives in tropical and subtropical climates with temperatures between 70-90°F (21-32°C). Plant in fertile, well-draining soil enriched with organic matter. Choose a location that receives partial sunlight to full sun, with some protection during intense midday heat. Provide a strong support structure like a trellis or fence, as Giloy is a vigorous climber. Water regularly during the growing season to maintain consistent soil moisture, reducing frequency during winter. Apply organic fertilizer or compost once every 2-3 months during the growing season. Prune occasionally to control growth and promote bushiness, especially after the flowering season. The plant is generally drought-tolerant once established but benefits from regular watering. Protect from frost in colder regions, as Giloy is not frost-hardy. Harvest stems and leaves after the plant has matured for at least one year, cutting stems in 6-inch segments for medicinal use."
  },
  {
    "name": "Ginger",
    "scientificName": "Zingiber officinale",
    "description": "Ginger is a flowering plant whose rhizome (underground stem) is widely used as a spice and medicinal herb around the world. This aromatic perennial produces reed-like stems up to three feet tall with narrow green leaves arranged in two ranks on each stem. The plant occasionally produces delicate yellow-green flowers with purple markings in tropical environments. However, it's primarily cultivated for its knobbly, fibrous rhizome which has a pungent, spicy flavor. Ginger has been used for over 5,000 years in traditional medicine systems, particularly in Asian cultures, to treat ailments ranging from digestive issues to pain relief. The rhizome contains numerous bioactive compounds, including gingerol, which gives it anti-inflammatory and antioxidant properties. Ginger is known to help alleviate nausea, reduce muscle pain, lower blood sugar levels, and may even have anti-cancer properties. It's also a versatile culinary ingredient used in both sweet and savory dishes across many global cuisines.",
    "modelPath": "/models/ginger.glb",
    "careInstructions": "Ginger thrives in warm, humid conditions with temperatures between 75-85°F (24-29°C). Plant rhizome pieces with growth buds (eyes) facing upward in rich, well-draining soil with a pH between 5.5-6.5. Position in partial shade, especially in hotter climates, as full sun can stress the plant. Maintain consistently moist but not waterlogged soil; water when the top inch of soil begins to dry. Apply a balanced organic fertilizer monthly during the growing season or use compost tea every 2-3 weeks. Mulch around plants to retain moisture and suppress weeds. In containers, choose pots at least 12 inches deep with drainage holes. Harvest ginger by carefully digging around the edges of the rhizome when the stems turn yellow, typically 8-10 months after planting. For warmer climates, ginger can be grown as a perennial; in cooler zones, harvest completely before frost or grow as an annual. Protect from strong winds, which can damage the tall, slender stems."
  },
  {
    "name": "Hibiscus",
    "scientificName": "Hibiscus rosa-sinensis",
    "description": "Hibiscus is a genus of flowering plants in the mallow family renowned for its large, colorful, trumpet-shaped blooms that can reach 4-8 inches in diameter. The Chinese Hibiscus (Hibiscus rosa-sinensis) is particularly popular as an ornamental plant, featuring glossy, dark green, toothed leaves and spectacular flowers in shades of red, pink, orange, yellow, purple, or white, often with a prominent central column of stamens. These tropical evergreen shrubs can grow up to 15 feet tall in ideal conditions, though they're often kept smaller through pruning. Beyond their ornamental value, hibiscus flowers have been used for centuries in traditional medicine across various cultures. The flowers are rich in antioxidants, particularly anthocyanins and other flavonoids, and are commonly brewed into a tart, cranberry-like tea that may help lower blood pressure, support digestive health, and boost the immune system. In culinary applications, hibiscus is used in beverages, jams, and as a natural food coloring.",
    "modelPath": "/models/hibiscus.glb",
    "careInstructions": "Hibiscus plants thrive in warm conditions with temperatures ideally between 60-90°F (15-32°C). Plant in rich, well-draining soil with a slightly acidic to neutral pH (6.0-7.0). Position in a location that receives full sun to partial shade; in hotter climates, afternoon shade is beneficial to prevent scorching. Water deeply when the top inch of soil feels dry, typically 2-3 times per week during growing season, reducing in winter. Avoid overwatering, which can lead to root rot. Apply a balanced, slow-release fertilizer formulated for flowering plants monthly during the growing season, or use a liquid fertilizer at half strength every two weeks. Prune after flowering to maintain shape and encourage bushier growth and more abundant blooming. In colder climates, bring potted hibiscus indoors before temperatures drop below 50°F (10°C). Monitor for pests such as aphids, whiteflies, and spider mites, treating promptly with insecticidal soap or neem oil. Increase humidity around indoor plants by misting leaves or using a humidity tray."
  },
  {
    "name": "Iphigenia stellata",
    "scientificName": "Iphigenia stellata",
    "description": "Iphigenia stellata is a rare and endangered medicinal herb native to the Western Ghats of India. This small, bulbous perennial belongs to the Colchicaceae family and is characterized by its slender stem, narrow linear leaves, and delicate star-shaped flowers that bloom during the monsoon season. The flowers exhibit a distinctive star-like formation with six tepals, typically white or pale pink with purple veining. Despite its unassuming appearance, this plant has significant ethnobotanical importance in traditional medicine systems. The bulbs contain colchicine and other alkaloids with potential anti-inflammatory and anti-cancer properties. Indigenous communities have historically used preparations from this plant to treat gout, rheumatism, and various inflammatory conditions. Due to overharvesting for medicinal purposes and habitat loss, Iphigenia stellata has become increasingly rare in its natural habitat, leading to conservation concerns. Scientific research on this species continues to explore its pharmaceutical potential while emphasizing the need for sustainable cultivation practices.",
    "modelPath": "/models/iphigeniastellata.glb",
    "careInstructions": "Iphigenia stellata requires specific growing conditions that mimic its natural Western Ghats habitat. Plant bulbs in well-draining, humus-rich soil with slight acidity (pH 6.0-6.5). Position in dappled shade to partial sun, avoiding intense direct sunlight. Water moderately during the growing season (monsoon period), keeping soil consistently moist but never waterlogged. Allow the soil to dry slightly between waterings as the flowering period ends. Reduce watering significantly during the dormant period when leaves die back. Apply a diluted, balanced organic fertilizer once monthly during the active growing phase. Protect from extreme temperatures; the ideal range is 65-80°F (18-27°C). Increase humidity around the plant during dry periods by misting or placing on a pebble tray with water. Propagate by carefully separating bulb offsets during the dormant period. Plant in groups of 3-5 bulbs for better visual impact and pollination. Mulch lightly to retain moisture and suppress weeds, being careful not to cover the crown of the plant. Due to its endangered status, consider obtaining specimens only from reputable nurseries that specialize in rare plant conservation."
  },
  {
    "name": "Kalmegh",
    "scientificName": "Andrographis paniculata",
    "description": "Kalmegh, also known as the 'King of Bitters' due to its intensely bitter taste, is a herbaceous annual plant native to South Asian countries. This medicinal herb grows up to 1-3 feet tall with a square stem and lance-shaped leaves that are dark green on top and lighter underneath. It produces small, white to purple flowers with spots, which develop into capsule-shaped fruits containing numerous yellow-brown seeds. Kalmegh has been a cornerstone of traditional Ayurvedic, Unani, and Traditional Chinese Medicine for centuries. Its primary bioactive compound, andrographolide, exhibits powerful immune-boosting, anti-inflammatory, antiviral, and antibacterial properties. Historically, it has been used to treat infectious diseases, fevers, sore throats, and upper respiratory infections. Modern research has confirmed many of its traditional uses, finding evidence for its effectiveness against common cold, influenza, and other infections. The plant is also being studied for potential benefits in treating diabetes, cancer, and liver disorders. In India, it forms a key ingredient in several polyherbal formulations designed to enhance immunity.",
    "modelPath": "/models/kalmegh.glb",
    "careInstructions": "Kalmegh thrives in tropical and subtropical climates with temperatures between 70-85°F (21-29°C). Plant in well-draining, loamy soil with moderate fertility and a pH of 6.0-7.5. Choose a location with full to partial sunlight; in very hot regions, afternoon shade is beneficial. Water regularly to maintain even soil moisture, especially during dry periods, but avoid waterlogging as it can cause root rot. Apply a balanced organic fertilizer once every 6-8 weeks during the growing season, or incorporate compost into the soil before planting. Space plants 12-18 inches apart to allow proper air circulation. Pinch the growing tips when plants reach 8 inches tall to encourage bushier growth and increased leaf production. Harvest leaves and stems just before or during early flowering stage when the concentration of active compounds is highest, typically 3-4 months after planting. The plant can self-seed readily, so remove some flower heads before they set seed if you want to control its spread. In cooler climates, grow as an annual or protect from frost; in tropical areas, it can be maintained as a short-lived perennial with proper care."
  },
  {
    "name": "Mimosa",
    "scientificName": "Mimosa pudica",
    "description": "Mimosa pudica, commonly known as the Sensitive Plant or Touch-Me-Not, is a fascinating creeping annual or perennial flowering plant native to South and Central America. This unique plant exhibits thigmotropism—a remarkable response to touch or vibration by rapidly folding its compound leaves and drooping, as if shy, hence its nickname 'Shy Plant.' The plant grows to about 1.5 feet tall with prickly stems and bipinnate leaves consisting of many small leaflets arranged in pairs. It produces fluffy, ball-shaped flowers that are pale pink to lavender in color. Beyond its intriguing mechanical response, which serves as a defense mechanism against herbivores, Mimosa pudica has been used in traditional medicine systems for centuries. The plant contains various bioactive compounds, including mimosine, tannins, and flavonoids, which contribute to its anti-inflammatory, antioxidant, and antimicrobial properties. In Ayurvedic medicine, it has been used to treat various conditions including diarrhea, dysentery, insomnia, and skin disorders. Recent scientific studies have explored its potential benefits for memory enhancement, wound healing, and managing diabetes.",
    "modelPath": "/models/mimosa.glb",
    "careInstructions": "Mimosa pudica thrives in warm, tropical conditions with temperatures between 65-85°F (18-29°C). Plant in well-draining, sandy loam soil with slight acidity (pH 6.0-7.0). Position in a location that receives bright, indirect light or partial sun; direct afternoon sun can scorch the delicate leaves. Water regularly to maintain evenly moist soil, but allow the top inch to dry slightly between waterings to prevent root rot. Reduce watering in winter or dormant periods. Apply a balanced, diluted organic fertilizer once a month during the growing season. Maintain humidity around 60-70% for optimal growth, especially for indoor plants. Prune lightly to maintain shape and remove any damaged stems. Watch for pests such as spider mites, aphids, and mealybugs, treating promptly with insecticidal soap if detected. In cooler climates, grow as an annual or keep as a houseplant, protecting from temperatures below 55°F (13°C). The plant can self-seed readily in ideal conditions, so remove seed pods before they mature if you want to control its spread. For indoor cultivation, occasional gentle touching of the leaves can help maintain the plant's sensitivity response mechanism."
  },
  {
    "name": "Neem",
    "scientificName": "Azadirachta indica",
    "description": "Neem is a fast-growing evergreen tree native to the Indian subcontinent, known for its remarkable medicinal properties and versatile applications. This majestic tree can grow up to 50-65 feet tall with spreading branches forming a rounded crown, though it's often kept smaller in cultivation. It features compound leaves with serrated leaflets that remain green year-round and produces small, white, fragrant flowers that develop into olive-like fruits. Revered as a 'village pharmacy' in its native regions, nearly every part of the neem tree—leaves, bark, seeds, roots, flowers, and fruits—contains bioactive compounds with medicinal value. The tree's most notable component, azadirachtin, is a powerful natural insecticide that doesn't harm beneficial insects, making neem an important tool in organic farming. In traditional Ayurvedic medicine, neem has been used for over 4,000 years to treat various ailments including skin disorders, infections, fever, and dental issues. Modern research has confirmed its antibacterial, antiviral, anti-inflammatory, and immune-boosting properties. Additionally, neem oil is widely used in cosmetics, soaps, and personal care products for its skin benefits and natural pesticide qualities.",
    "modelPath": "/models/neem.glb",
    "careInstructions": "Neem trees thrive in tropical and subtropical climates with temperatures between 70-100°F (21-38°C). Plant in well-draining soil with a pH range of 6.2-7.2; the tree is adaptable to various soil types including poor, rocky, or clayey soils. Position in full sun, as neem requires at least 6-8 hours of direct sunlight daily for optimal growth. Water deeply but infrequently, allowing the soil to dry between waterings once established; neem is notably drought-resistant. For young trees, provide moderate water until well-established, typically for the first 2-3 years. Apply a balanced organic fertilizer annually at the beginning of the growing season, or incorporate compost around the base of the tree. Space trees at least 15-20 feet apart if planting multiple specimens. Prune during the dormant season to maintain shape and remove dead or crossing branches. Protect from frost in cooler regions, as neem is sensitive to freezing temperatures. The tree begins producing flowers and fruits typically after 3-5 years. Harvest leaves as needed throughout the year, and collect seeds from fallen fruits for oil extraction or propagation. Be mindful that neem can become invasive in some tropical regions due to its prolific seed production."
  },
  {
    "name": "Palm Tree",
    "scientificName": "Arecaceae",
    "description": "Palm trees comprise over 2,600 species within the Arecaceae family, distinguished by their characteristic growth form featuring a crown of large evergreen leaves atop an unbranched stem. These iconic tropical and subtropical plants range dramatically in size and appearance, from the towering Royal Palm that can reach heights of 80 feet to the compact Parlor Palm suitable for indoor cultivation. Most palm species display either fan-shaped (palmate) or feather-shaped (pinnate) leaves, often of impressive size, creating their distinctive silhouette recognizable worldwide. Beyond their ornamental value and association with tropical paradises, palms have immense economic and cultural significance. They provide essential resources including dates, coconuts, palm oil, sago starch, rattan, and materials for construction, basketry, and thatching. Many species also have medicinal properties, with parts used in traditional healing practices across various cultures. Palm trees are incredibly adaptable, having evolved to thrive in diverse environments from rainforests to deserts, though most prefer warm climates with good moisture. Their deep cultural symbolism represents victory, peace, and abundance in many societies.",
    "modelPath": "/models/palm_tree.glb",
    "careInstructions": "Palm tree care varies by species, but most share certain requirements. Plant in well-draining, slightly acidic to neutral soil (pH 6.0-7.0) enriched with organic matter. Choose a location based on the specific palm's light needs—many tropical varieties prefer full to partial sun, while certain understory species require filtered light or partial shade. Water deeply but infrequently, allowing the soil to dry slightly between waterings; most established palms are somewhat drought-tolerant but benefit from consistent moisture. Apply a specialized palm fertilizer with appropriate micronutrients (especially magnesium, manganese, and iron) three to four times per year during the growing season. Maintain adequate humidity for indoor palms by misting regularly or using a humidifier. Avoid pruning living fronds as palms obtain nutrients from their leaves; only remove completely brown, dead fronds. Never cut or damage the central growing point (the 'heart') as this will kill the entire palm. Protect cold-sensitive species from freezing temperatures and strong, drying winds. Watch for pests such as spider mites, scale insects, and palm weevils. For container-grown palms, repot every 2-3 years or when roots begin circling the pot. Different palm species have varying salt and drought tolerance, so research specific requirements for your particular variety."
  },
  {
    "name": "Red Poppy",
    "scientificName": "Papaver rhoeas",
    "description": "The Red Poppy, also known as the Corn Poppy or Flanders Poppy, is an annual flowering plant native to Europe and Asia that has spread worldwide. This delicate yet resilient wildflower grows to heights of 20-27 inches and is instantly recognizable by its vibrant scarlet-red, cup-shaped blooms with distinctive black centers ringed by prominent dark stamens. Each flower has four silky, crinkled petals that create a paper-like appearance, blooming dramatically but briefly—often lasting just a day before the petals fall. The plant features deeply lobed, hairy leaves arranged in a rosette at the base and produces capsule fruits containing numerous tiny seeds that can remain dormant in soil for decades. Beyond its striking beauty, the Red Poppy holds profound cultural and historical significance as a symbol of remembrance for fallen soldiers, particularly from World War I, due to its abundance on battlefields. Unlike its cousin the opium poppy, Red Poppies contain minimal alkaloids and are not used for opiate production. However, they do have mild sedative properties and have been used in traditional medicine for minor pain relief, as a mild sleep aid, and to soothe coughs. The petals are occasionally used to make a natural red dye or as a decorative, edible garnish.",
    "modelPath": "/models/red_poppy.glb",
    "careInstructions": "Red Poppies thrive in full sun locations with at least 6 hours of direct sunlight daily. Plant in well-draining, poor to moderately fertile soil with a pH between 6.0-7.0; overly rich soil promotes foliage growth at the expense of flowers. Sow seeds directly in the garden in autumn or early spring when soil temperatures are cool, as poppies prefer cool weather for germination and early growth. Scatter seeds on prepared soil and press lightly into surface without covering, as poppy seeds need light to germinate. Space plants or thin seedlings to 6-10 inches apart to prevent overcrowding. Water sparingly; poppies are drought-tolerant once established and prefer dry conditions. Avoid overhead watering which can damage the delicate flowers. No fertilization is typically necessary and can actually reduce blooming; these flowers naturally prefer less fertile soil. Deadhead spent blooms to encourage additional flowering unless you want the plants to self-seed. Allow some flowers to form seed heads at the end of the season if you want volunteer plants next year. Poppies generally don't transplant well due to their taproot, so it's best to sow them where they will grow. These plants are generally pest and disease resistant but watch for aphids in spring. Red poppies work well in meadow plantings, cottage gardens, and naturalized areas where they can self-seed freely."
  },
  {
    "name": "Shatavari",
    "scientificName": "Asparagus racemosus",
    "description": "Shatavari, meaning 'she who possesses a hundred husbands' in Sanskrit, is a species of asparagus widely cultivated throughout tropical and subtropical regions of India, Nepal, and Sri Lanka. This climbing plant grows up to 1-2 meters in height and features tiny white flowers on branched racemes, followed by black berries. The plant's true value lies in its extensive root system of succulent, tuberous roots that expand radially like spokes from the center. These roots, which can grow up to 3 feet in length, are the primary medicinal part of the plant. Shatavari holds a place of prominence in Ayurvedic medicine spanning thousands of years, where it is classified as a rasayana herb that promotes youth and vitality. It is particularly renowned for its effects on the female reproductive system—supporting fertility, healthy lactation, hormonal balance, and easing menopausal symptoms. The roots contain steroidal saponins, especially shatavarins, which contribute to its adaptogenic, anti-inflammatory, and immunomodulatory properties. Modern research confirms many traditional uses and has identified additional benefits, including antioxidant, antibacterial, antidepressant, and hepatoprotective effects. Beyond medicinal applications, young shoots of Shatavari can be consumed as a vegetable similar to cultivated asparagus.",
    "modelPath": "/models/shatavari.glb",
    "careInstructions": "Shatavari thrives in tropical and subtropical climates with temperatures between 70-90°F (21-32°C). Plant in well-draining, fertile, sandy-loam soil with a pH between 6.0-8.0. Choose a location with partial shade in hot climates or full sun in more temperate regions. Water regularly to maintain consistent soil moisture, especially during dry periods, but avoid waterlogging which can cause root rot. Apply organic compost or well-rotted manure before planting and as a top dressing annually. For commercial cultivation, space plants 60x60 cm apart in raised beds to facilitate root development and harvesting. Support the climbing stems with trellises or stakes as the plant matures. Apply a balanced organic fertilizer once every 2-3 months during the growing season. Mulch around the base to conserve moisture and suppress weeds. Protect from strong winds which can damage the delicate fernlike foliage. The plant requires minimal pruning, except to remove damaged or diseased parts. Roots are typically harvested after 1-2 years of growth when the plant has matured sufficiently. In regions with cold winters, provide frost protection or grow as an annual. Propagate by dividing root clusters or from seeds, though seed germination can be slow and irregular. Watch for pests such as aphids, mites, and nematodes, treating with appropriate organic methods if detected."
  },
  {
  "name": "Thalictrum dalzellii",
  "scientificName": "Thalictrum dalzellii",
  "description": "Thalictrum dalzellii, commonly known as Dalzell's Meadow-rue, is a rare endemic plant species found exclusively in the Western Ghats of India. This elegant perennial herb grows to a height of 1-2 meters and features delicate, compound leaves that resemble those of a maidenhair fern, creating a lacy, airy appearance. During the monsoon season, the plant produces clusters of small, pendulous flowers in shades of pale yellow to white, with prominent stamens that give them a fluffy, cloud-like quality. Unlike many showier garden plants, Thalictrum dalzellii's beauty lies in its subtle, graceful form and fine-textured foliage. This rare species holds significant botanical importance as it is endemic to a small region and faces conservation challenges due to habitat loss. In traditional medicine systems of the Western Ghats indigenous communities, the plant has been used for its potential anti-inflammatory and analgesic properties. The roots and leaves contain various alkaloids, including thalicarpine and berberine compounds, which contribute to its medicinal value. Botanical researchers continue to study this species for both conservation purposes and to better understand its phytochemical properties and potential applications. Its limited distribution and specific habitat requirements make it an important indicator species for monitoring the health of Western Ghats ecosystems.",
  "modelPath": "/models/thalictrum_dalzellii.glb",
  "careInstructions": "Thalictrum dalzellii requires specific conditions that mimic its native Western Ghats habitat. Plant in humus-rich, moist but well-draining soil with a pH between 6.0-7.0. Position in dappled shade or areas with morning sun and afternoon shade, as it naturally grows under the forest canopy. Water regularly to maintain consistent soil moisture, particularly during dry periods, but avoid waterlogging which can cause root rot. Apply a layer of leaf mold or organic compost annually to replicate its natural forest floor environment. Fertilize sparingly with a balanced, slow-release organic fertilizer once in spring. Provide protection from strong winds, which can damage the delicate foliage and stems. In cultivation, support taller specimens with discrete stakes or plant among sturdy perennials that can offer natural support. Maintain high humidity around the plant, especially in drier climates, by misting regularly or planting in naturally humid areas of the garden. Mulch with leaf litter to conserve moisture and add nutrients. Propagate by division of rhizomes in early spring or by seed, though germination can be slow and irregular. Due to its rare and endemic nature, ensure any specimens are sourced ethically from sustainable nurseries specializing in native Indian plants. In temperate climates, provide winter protection or grow in a cool greenhouse, as this species is not frost-hardy. Watch for slug and snail damage on young growth."
},
{
  "name": "Tulsi",
  "scientificName": "Ocimum sanctum",
  "description": "Tulsi, also known as Holy Basil or the 'Queen of Herbs,' is a sacred aromatic plant deeply embedded in Indian culture and Ayurvedic medicine for over 3,000 years. This bushy perennial grows to 1-2 feet tall and features aromatic, oval leaves with serrated edges that can range in color from light green to purple, depending on the variety. The plant produces small purple-pink flowers on elongated racemes and has a distinct clove-like scent with notes of pepper, mint, and licorice. Beyond its religious significance in Hinduism, where it's revered as an earthly manifestation of the goddess Lakshmi, Tulsi is considered a potent adaptogen that helps the body counter physical, chemical, environmental, and emotional stressors. The leaves contain essential oils (eugenol, caryophyllene, methyl eugenol) and other bioactive compounds with powerful pharmacological properties. Scientific research has validated many traditional uses, confirming Tulsi's adaptogenic, antimicrobial, anti-inflammatory, antioxidant, and immunomodulatory effects. It's commonly used to address respiratory conditions, stress, anxiety, diabetes, heart disease, and skin disorders. As a daily tonic, Tulsi tea is consumed to promote general wellness, longevity, and spiritual clarity. In addition to its medicinal applications, Tulsi serves as a natural insect repellent in gardens and homes, deterring mosquitoes and protecting nearby plants from pest infestations.",
  "modelPath": "/models/tulsi.glb",
  "careInstructions": "Tulsi thrives in warm, tropical to subtropical climates with temperatures between 70-85°F (21-29°C). Plant in well-draining, fertile soil with a pH between 6.5-7.5; a mixture of garden soil, sand, and compost in equal parts works well. Position in full sun to partial shade, with at least 4-6 hours of direct sunlight daily for optimal growth and essential oil production. Water regularly to maintain moderate soil moisture, allowing the top inch of soil to dry between waterings. Reduce watering during winter months. Apply a balanced organic fertilizer once a month during the growing season, or use compost tea every 2-3 weeks. Pinch the growing tips and flower buds regularly to encourage bushy growth and prevent early flowering, which extends the vegetative phase and leaf production. Harvest leaves frequently by pinching stems just above a pair of leaves to stimulate new growth. For medicinal use, harvest in the morning after dew has dried but before the heat of the day, when essential oil content is highest. Tulsi can be grown successfully in containers at least 10 inches deep with good drainage. Protect from cold temperatures below 50°F (10°C). In cooler climates, grow as an annual or bring indoors during winter. Watch for pests such as aphids and whiteflies, treating with neem oil if detected. Avoid using chemical pesticides on this medicinal herb. Seeds can be collected from dried flower heads for future planting, though the plant also self-seeds readily in favorable conditions."
},
{
  "name": "Turmeric",
  "scientificName": "Curcuma longa",
  "description": "Turmeric is a perennial herbaceous plant belonging to the ginger family, Zingiberaceae, native to the Indian subcontinent and Southeast Asia. This remarkable plant grows to a height of 3-5 feet and features large, oblong leaves emerging directly from the ground in spiral arrangements. While its above-ground foliage is impressive, turmeric's true treasure lies beneath the soil in its branched, aromatic rhizomes that display a vibrant orange-yellow interior flesh. The plant occasionally produces spike-like flowers with white to pink bracts, though it rarely flowers in cultivation. Turmeric has been used for over 4,000 years in Ayurvedic medicine and holds profound cultural significance, particularly in Indian ceremonies and cuisine. The rhizome contains curcumin, a polyphenol with powerful anti-inflammatory and antioxidant properties that gives turmeric its distinctive color and medicinal value. Modern scientific research has validated many traditional uses, showing potential benefits for conditions including arthritis, digestive disorders, liver function, heart disease, and even certain cancers. Beyond its medicinal applications, turmeric serves as a key culinary spice in cuisines worldwide, most notably in curry powders, and is used as a natural dye for textiles and food coloring. The plant also has applications in skincare, with traditional uses for improving complexion and treating skin conditions. Its sustainability and relatively low-maintenance nature make it an increasingly popular crop for small-scale farmers seeking valuable crops with multiple applications.",
  "modelPath": "/models/turmeric.glb",
  "careInstructions": "Turmeric thrives in tropical to subtropical climates with temperatures between 68-86°F (20-30°C). Plant rhizome pieces with 2-3 buds each, positioned 2 inches deep in rich, well-draining, slightly acidic to neutral soil (pH 6.0-7.5) with high organic matter content. Choose a location with partial shade to full sun, though some afternoon shade is beneficial in hotter regions. Water regularly to maintain consistently moist but not waterlogged soil; turmeric requires ample water during the growing season, especially during dry periods. Apply a balanced organic fertilizer or compost monthly during the active growing period. Mulch around plants to retain moisture, suppress weeds, and provide additional nutrients as it breaks down. Space plants 12-18 inches apart to allow proper development of the extensive rhizome system. In cooler climates, grow in containers that can be moved indoors during colder months, as turmeric is frost-sensitive and goes dormant below 50°F (10°C). For container growing, choose pots at least 12-14 inches deep to accommodate rhizome development. Harvest rhizomes approximately 8-10 months after planting when the leaves and stem start to turn yellow and dry, typically after flowering. Carefully dig around the plant to avoid damaging the rhizomes. Set aside the largest, healthiest rhizomes for replanting. Cure harvested rhizomes by boiling briefly and then drying thoroughly in the sun before storing in a cool, dry place. Watch for pests such as scale insects and diseases like rhizome rot in overly wet conditions. In regions with a distinct winter, the plant will die back naturally; cut the dried stems and preserve the rhizomes in dry sand until the next planting season."
}
]